In [2]:
import pandas as pd

In [44]:
emp_df=pd.read_csv("emp.csv")
emp_df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [11]:
emp_df.shape

(1000, 8)

In [12]:
emp_df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [14]:
emp_df["Start Date"]=pd.to_datetime(emp_df["Start Date"])

In [16]:
emp_df.dtypes#start date converted from object to date type

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time              object
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                         object
dtype: object

In [18]:
emp_df.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [21]:
emp_df.info

<bound method DataFrame.info of     First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male 1993-08-06        12:42 PM   97308    6.945
1       Thomas    Male 1996-03-31         6:53 AM   61933    4.170
2        Maria  Female 1993-04-23        11:17 AM  130590   11.858
3        Jerry    Male 2005-03-04         1:00 PM  138705    9.340
4        Larry    Male 1998-01-24         4:47 PM  101004    1.389
..         ...     ...        ...             ...     ...      ...
995      Henry     NaN 2014-11-23         6:09 AM  132483   16.655
996    Phillip    Male 1984-01-31         6:30 AM   42392   19.675
997    Russell    Male 2013-05-20        12:39 PM   96914    1.421
998      Larry    Male 2013-04-20         4:45 PM   60500   11.985
999     Albert    Male 2012-05-15         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]>

In [23]:
emp_df.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [45]:
emp_df["Gender"].fillna("No Gender", inplace = True)

In [46]:
emp_df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [47]:
df=emp_df.groupby(['Gender']) #group by gender
df.count()

,First Name,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
Gender,,,,,,,
Female,400,431,431,431,431,400,418
Male,395,424,424,424,424,395,398
No Gender,138,145,145,145,145,138,141

In [55]:
emp_df['Senior Management']=emp_df['Senior Management'].fillna(emp_df['Senior Management'].mode()[0])
emp_df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,True,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,No Gender,11/23/2014,6:09 AM,132483,16.655,True,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,True,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,True,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,True,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [56]:
emp_df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management     0
Team                 43
dtype: int64

In [57]:
emp_df.to_csv("Final_emp_df")